; domain
(define (domain blocksworld)
  (:requirements :strips)
  (:predicates 
			(on ?x ?y)
			(ontable ?x)
			(clear ?x)
			(handempty)
			(holding ?x)
  )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem problem_4_300)
(:domain blocksworld)
(:objects b1 b2 b3 b4)
(:init 
(handempty)
(on b1 b2)
(clear b1)
(ontable b2)
(ontable b3)
(clear b3)
(ontable b4)
(clear b4)
)
(:goal
(and
(on b1 b2)
(clear b1)
(on b2 b4)
(ontable b3)
(on b4 b3)

)

)
)

; plan
1. (pick-up b4)
   deleted: (ontable b4) (clear b4) (handempty)
   added: (holding b4)
   goals met: 3 of 5
2. (stack b4 b3)
   deleted: (holding b4) (clear b3)
   added: (clear b4) (handempty) (on b4 b3)
   goals met: 4 of 5
3. (unstack b1 b2)
   deleted: (clear b1) (handempty) (on b1 b2)
   added: (holding b1) (clear b2)
   goals met: 2 of 5
4. (put-down b1)
   deleted: (holding b1)
   added: (clear b1) (handempty) (ontable b1)
   goals met: 3 of 5
5. (pick-up b2)
   deleted: (ontable b2) (clear b2) (handempty)
   added: (holding b2)
   goals met: 3 of 5
6. (stack b2 b4)
   deleted: (holding b2) (clear b4)
   added: (clear b2) (handempty) (on b2 b4)
   goals met: 4 of 5
7. (pick-up b1)
   deleted: (ontable b1) (clear b1) (handempty)
   added: (holding b1)
   goals met: 3 of 5
8. (stack b1 b2)
   deleted: (holding b1) (clear b2)
   added: (clear b1) (handempty) (on b1 b2)
   goals met: 5 of 5
